{"format": "layers-model", "generatedBy": "keras v2.6.0", "convertedBy": "TensorFlow.js Converter v3.13.0", "modelTopology": {"keras_version": "2.6.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "original", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 64, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "face_in_a"}, "name": "face_in_a", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 64, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "face_in_b"}, "name": "face_in_b", "inbound_nodes": []}, {"class_name": "Functional", "config": {"name": "encoder", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 64, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv_128_0_conv2d", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [5, 5], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_128_0_conv2d", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "conv_128_0_leakyrelu", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "conv_128_0_leakyrelu", "inbound_nodes": [[["conv_128_0_conv2d", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_256_0_conv2d", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [5, 5], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_256_0_conv2d", "inbound_nodes": [[["conv_128_0_leakyrelu", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "conv_256_0_leakyrelu", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "conv_256_0_leakyrelu", "inbound_nodes": [[["conv_256_0_conv2d", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_512_0_conv2d", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [5, 5], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_512_0_conv2d", "inbound_nodes": [[["conv_256_0_leakyrelu", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "conv_512_0_leakyrelu", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "conv_512_0_leakyrelu", "inbound_nodes": [[["conv_512_0_conv2d", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_1024_0_conv2d", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [5, 5], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_1024_0_conv2d", "inbound_nodes": [[["conv_512_0_leakyrelu", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "conv_1024_0_leakyrelu", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "conv_1024_0_leakyrelu", "inbound_nodes": [[["conv_1024_0_conv2d", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten", "inbound_nodes": [[["conv_1024_0_leakyrelu", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 1024, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 16384, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "dtype": "float32", "target_shape": [4, 4, 1024]}, "name": "reshape", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "upscale_512_0_conv2d_conv2d", "trainable": true, "dtype": "float32", "filters": 2048, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "upscale_512_0_conv2d_conv2d", "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "upscale_512_0_conv2d_leakyrelu", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "upscale_512_0_conv2d_leakyrelu", "inbound_nodes": [[["upscale_512_0_conv2d_conv2d", 0, 0, {}]]]}, {"class_name": "PixelShuffler", "config": {"name": "upscale_512_0_pixelshuffler", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last"}, "name": "upscale_512_0_pixelshuffler", "inbound_nodes": [[["upscale_512_0_conv2d_leakyrelu", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["upscale_512_0_pixelshuffler", 0, 0]]}, "name": "encoder", "inbound_nodes": [[["face_in_a", 0, 0, {}]], [["face_in_b", 0, 0, {}]]]}, {"class_name": "Functional", "config": {"name": "decoder_a", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 8, 8, 512], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}, "name": "input_2", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "upscale_256_0_conv2d_conv2d", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "upscale_256_0_conv2d_conv2d", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "upscale_256_0_conv2d_leakyrelu", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "upscale_256_0_conv2d_leakyrelu", "inbound_nodes": [[["upscale_256_0_conv2d_conv2d", 0, 0, {}]]]}, {"class_name": "PixelShuffler", "config": {"name": "upscale_256_0_pixelshuffler", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last"}, "name": "upscale_256_0_pixelshuffler", "inbound_nodes": [[["upscale_256_0_conv2d_leakyrelu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "upscale_128_0_conv2d_conv2d", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "upscale_128_0_conv2d_conv2d", "inbound_nodes": [[["upscale_256_0_pixelshuffler", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "upscale_128_0_conv2d_leakyrelu", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "upscale_128_0_conv2d_leakyrelu", "inbound_nodes": [[["upscale_128_0_conv2d_conv2d", 0, 0, {}]]]}, {"class_name": "PixelShuffler", "config": {"name": "upscale_128_0_pixelshuffler", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last"}, "name": "upscale_128_0_pixelshuffler", "inbound_nodes": [[["upscale_128_0_conv2d_leakyrelu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "upscale_64_0_conv2d_conv2d", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "upscale_64_0_conv2d_conv2d", "inbound_nodes": [[["upscale_128_0_pixelshuffler", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "upscale_64_0_conv2d_leakyrelu", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "upscale_64_0_conv2d_leakyrelu", "inbound_nodes": [[["upscale_64_0_conv2d_conv2d", 0, 0, {}]]]}, {"class_name": "PixelShuffler", "config": {"name": "upscale_64_0_pixelshuffler", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last"}, "name": "upscale_64_0_pixelshuffler", "inbound_nodes": [[["upscale_64_0_conv2d_leakyrelu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "face_out_a_conv2d", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "face_out_a_conv2d", "inbound_nodes": [[["upscale_64_0_pixelshuffler", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "face_out_a", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "face_out_a", "inbound_nodes": [[["face_out_a_conv2d", 0, 0, {}]]]}], "input_layers": [["input_2", 0, 0]], "output_layers": [["face_out_a", 0, 0]]}, "name": "decoder_a", "inbound_nodes": [[["encoder", 1, 0, {}]]]}, {"class_name": "Functional", "config": {"name": "decoder_b", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 8, 8, 512], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_3"}, "name": "input_3", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "upscale_256_1_conv2d_conv2d", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "upscale_256_1_conv2d_conv2d", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "upscale_256_1_conv2d_leakyrelu", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "upscale_256_1_conv2d_leakyrelu", "inbound_nodes": [[["upscale_256_1_conv2d_conv2d", 0, 0, {}]]]}, {"class_name": "PixelShuffler", "config": {"name": "upscale_256_1_pixelshuffler", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last"}, "name": "upscale_256_1_pixelshuffler", "inbound_nodes": [[["upscale_256_1_conv2d_leakyrelu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "upscale_128_1_conv2d_conv2d", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "upscale_128_1_conv2d_conv2d", "inbound_nodes": [[["upscale_256_1_pixelshuffler", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "upscale_128_1_conv2d_leakyrelu", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "upscale_128_1_conv2d_leakyrelu", "inbound_nodes": [[["upscale_128_1_conv2d_conv2d", 0, 0, {}]]]}, {"class_name": "PixelShuffler", "config": {"name": "upscale_128_1_pixelshuffler", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last"}, "name": "upscale_128_1_pixelshuffler", "inbound_nodes": [[["upscale_128_1_conv2d_leakyrelu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "upscale_64_1_conv2d_conv2d", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "upscale_64_1_conv2d_conv2d", "inbound_nodes": [[["upscale_128_1_pixelshuffler", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "upscale_64_1_conv2d_leakyrelu", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "name": "upscale_64_1_conv2d_leakyrelu", "inbound_nodes": [[["upscale_64_1_conv2d_conv2d", 0, 0, {}]]]}, {"class_name": "PixelShuffler", "config": {"name": "upscale_64_1_pixelshuffler", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last"}, "name": "upscale_64_1_pixelshuffler", "inbound_nodes": [[["upscale_64_1_conv2d_leakyrelu", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "face_out_b_conv2d", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "face_out_b_conv2d", "inbound_nodes": [[["upscale_64_1_pixelshuffler", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "face_out_b", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "face_out_b", "inbound_nodes": [[["face_out_b_conv2d", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0]], "output_layers": [["face_out_b", 0, 0]]}, "name": "decoder_b", "inbound_nodes": [[["encoder", 2, 0, {}]]]}], "input_layers": [["face_in_a", 0, 0], ["face_in_b", 0, 0]], "output_layers": [["decoder_a", 1, 0], ["decoder_b", 1, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of79.bin", "group1-shard2of79.bin", "group1-shard3of79.bin", "group1-shard4of79.bin", "group1-shard5of79.bin", "group1-shard6of79.bin", "group1-shard7of79.bin", "group1-shard8of79.bin", "group1-shard9of79.bin", "group1-shard10of79.bin", "group1-shard11of79.bin", "group1-shard12of79.bin", "group1-shard13of79.bin", "group1-shard14of79.bin", "group1-shard15of79.bin", "group1-shard16of79.bin", "group1-shard17of79.bin", "group1-shard18of79.bin", "group1-shard19of79.bin", "group1-shard20of79.bin", "group1-shard21of79.bin", "group1-shard22of79.bin", "group1-shard23of79.bin", "group1-shard24of79.bin", "group1-shard25of79.bin", "group1-shard26of79.bin", "group1-shard27of79.bin", "group1-shard28of79.bin", "group1-shard29of79.bin", "group1-shard30of79.bin", "group1-shard31of79.bin", "group1-shard32of79.bin", "group1-shard33of79.bin", "group1-shard34of79.bin", "group1-shard35of79.bin", "group1-shard36of79.bin", "group1-shard37of79.bin", "group1-shard38of79.bin", "group1-shard39of79.bin", "group1-shard40of79.bin", "group1-shard41of79.bin", "group1-shard42of79.bin", "group1-shard43of79.bin", "group1-shard44of79.bin", "group1-shard45of79.bin", "group1-shard46of79.bin", "group1-shard47of79.bin", "group1-shard48of79.bin", "group1-shard49of79.bin", "group1-shard50of79.bin", "group1-shard51of79.bin", "group1-shard52of79.bin", "group1-shard53of79.bin", "group1-shard54of79.bin", "group1-shard55of79.bin", "group1-shard56of79.bin", "group1-shard57of79.bin", "group1-shard58of79.bin", "group1-shard59of79.bin", "group1-shard60of79.bin", "group1-shard61of79.bin", "group1-shard62of79.bin", "group1-shard63of79.bin", "group1-shard64of79.bin", "group1-shard65of79.bin", "group1-shard66of79.bin", "group1-shard67of79.bin", "group1-shard68of79.bin", "group1-shard69of79.bin", "group1-shard70of79.bin", "group1-shard71of79.bin", "group1-shard72of79.bin", "group1-shard73of79.bin", "group1-shard74of79.bin", "group1-shard75of79.bin", "group1-shard76of79.bin", "group1-shard77of79.bin", "group1-shard78of79.bin", "group1-shard79of79.bin"], "weights": [{"name": "upscale_256_0_conv2d_conv2d/kernel", "shape": [3, 3, 512, 1024], "dtype": "float32"}, {"name": "upscale_256_0_conv2d_conv2d/bias", "shape": [1024], "dtype": "float32"}, {"name": "upscale_128_0_conv2d_conv2d/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "upscale_128_0_conv2d_conv2d/bias", "shape": [512], "dtype": "float32"}, {"name": "upscale_64_0_conv2d_conv2d/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "upscale_64_0_conv2d_conv2d/bias", "shape": [256], "dtype": "float32"}, {"name": "face_out_a_conv2d/kernel", "shape": [5, 5, 64, 3], "dtype": "float32"}, {"name": "face_out_a_conv2d/bias", "shape": [3], "dtype": "float32"}, {"name": "upscale_256_1_conv2d_conv2d/kernel", "shape": [3, 3, 512, 1024], "dtype": "float32"}, {"name": "upscale_256_1_conv2d_conv2d/bias", "shape": [1024], "dtype": "float32"}, {"name": "upscale_128_1_conv2d_conv2d/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "upscale_128_1_conv2d_conv2d/bias", "shape": [512], "dtype": "float32"}, {"name": "upscale_64_1_conv2d_conv2d/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "upscale_64_1_conv2d_conv2d/bias", "shape": [256], "dtype": "float32"}, {"name": "face_out_b_conv2d/kernel", "shape": [5, 5, 64, 3], "dtype": "float32"}, {"name": "face_out_b_conv2d/bias", "shape": [3], "dtype": "float32"}, {"name": "conv_128_0_conv2d/kernel", "shape": [5, 5, 3, 128], "dtype": "float32"}, {"name": "conv_128_0_conv2d/bias", "shape": [128], "dtype": "float32"}, {"name": "conv_256_0_conv2d/kernel", "shape": [5, 5, 128, 256], "dtype": "float32"}, {"name": "conv_256_0_conv2d/bias", "shape": [256], "dtype": "float32"}, {"name": "conv_512_0_conv2d/kernel", "shape": [5, 5, 256, 512], "dtype": "float32"}, {"name": "conv_512_0_conv2d/bias", "shape": [512], "dtype": "float32"}, {"name": "conv_1024_0_conv2d/kernel", "shape": [5, 5, 512, 1024], "dtype": "float32"}, {"name": "conv_1024_0_conv2d/bias", "shape": [1024], "dtype": "float32"}, {"name": "dense/kernel", "shape": [16384, 1024], "dtype": "float32"}, {"name": "dense/bias", "shape": [1024], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [1024, 16384], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [16384], "dtype": "float32"}, {"name": "upscale_512_0_conv2d_conv2d/kernel", "shape": [3, 3, 1024, 2048], "dtype": "float32"}, {"name": "upscale_512_0_conv2d_conv2d/bias", "shape": [2048], "dtype": "float32"}]}]}